app/controllers/content_mappings_controller.rb

SELECT * FROM `content_mappings` WHERE (`content_mappings`.`id` = 953125641) ORDER BY position ASC
---
  def show
    @content_mapping = ContentMapping.find(params[:id])

SELECT * FROM `content_mappings` WHERE (`content_mappings`.`id` = 953125641) ORDER BY position ASC
SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
---
  def new
    @content_mapping = ContentMapping.new
    @content_mapping.section = Section.find(params[:section_id]) if params[:section_id]
    @content_mapping.page = Page.find(params[:page_id]) if params[:page_id]

SELECT * FROM `content_mappings` WHERE (`content_mappings`.`id` = 953125641) ORDER BY position ASC
---
  def edit
    @content_mapping = ContentMapping.find(params[:id])

INSERT INTO `content_mappings` (`asset_type`, `position`, `created_at`, `section_id`, `updated_at`, `page_id`, `asset_id`) VALUES('TextBlock', NULL, '2009-06-17 03:32:50', 1, '2009-06-17 03:32:50', 1, 1)
---
  def create
    @content_mapping = ContentMapping.new(params[:content_mapping])

    respond_to do |format|
      if @content_mapping.save

SELECT * FROM `content_mappings` WHERE (`content_mappings`.`id` = 953125641) ORDER BY position ASC
---
  def update
    @content_mapping = ContentMapping.find(params[:id])

SELECT * FROM `content_mappings` WHERE (`content_mappings`.`id` = 953125641) ORDER BY position ASC
DELETE FROM `content_mappings` WHERE `id` = 953125641
---
  def destroy
    @content_mapping = ContentMapping.find(params[:id])
    @content_mapping.destroy