app/controllers/page_templates_controller.rb

SELECT * FROM `page_templates` WHERE (`page_templates`.`id` = 953125641)
---
  def show
    @page_template = PageTemplate.find(params[:id])

SELECT * FROM `page_templates` WHERE (`page_templates`.`id` = 953125641)
---
  def edit
    @page_template = PageTemplate.find(params[:id])

INSERT INTO `page_templates` (`updated_at`, `title`, `body`, `file_name`, `created_at`) VALUES('2009-02-17 23:40:01', NULL, NULL, NULL, '2009-02-17 23:40:01')
---
  def create
    @page_template = PageTemplate.new(params[:page_template])

    respond_to do |format|
      if @page_template.save

SELECT * FROM `page_templates` WHERE (`page_templates`.`id` = 953125641)
---
  def update
    @page_template = PageTemplate.find(params[:id])

SELECT * FROM `page_templates` WHERE (`page_templates`.`id` = 953125641)
DELETE FROM `page_templates` WHERE `id` = 953125641
---
  def destroy
    @page_template = PageTemplate.find(params[:id])
    @page_template.destroy