app/controllers/pages_controller.rb

  def index
    @pages = Page.find(:all)
---
SELECT * FROM `pages` WHERE (parent_id IS NULL) LIMIT 1

  def show

    @page = Page.find(params[:id]) if params[:id]
    @page ||= Page.find_by_permalink(params[:path].last)

    if @page && @page.redirect
      redirect_to @page.redirect_url and return unless @page.redirect_url.blank?
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 953125641)
SELECT * FROM `pages` WHERE (`pages`.`permalink` = 'show') LIMIT 1
SELECT * FROM `pages`

  def edit
    @page = Page.find(params[:id])
---
SELECT `pages`.id FROM `pages` WHERE (`pages`.parent_id = 1)

  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save && @page.move_to_child_of(params[:page][:parent_page_id])
---
INSERT INTO `pages` (`position`, `permalink`, `created_at`, `title`, `updated_at`, `lft`, `file_name`, `parent_id`, `rgt`, `page_template_id`) VALUES(NULL, 'hello', '2009-03-15 23:32:03', 'hello', '2009-03-15 23:32:03', NULL, NULL, NULL, NULL, NULL)

  def update
    @page = Page.find(params[:id])

    respond_to do |format|
      if @page.update_attributes(params[:page])
---
SELECT `pages`.id FROM `pages` WHERE (permalink = 'mystring' and id != 953125641) LIMIT 1
UPDATE `pages` SET `title` = 'changed', `permalink` = 'changed', `updated_at` = '2009-02-18 00:21:59' WHERE `id` = 953125641

  def destroy
    @page = Page.find(params[:id])
    @page.destroy
---
SELECT * FROM `pages` WHERE (`pages`.parent_id = 953125641)
DELETE FROM `pages` WHERE (1 = 1 and lft > 1 and rgt < 1)