app/controllers/sections_controller.rb

  def show
    @section = Section.find(params[:id])
---
SELECT * FROM `sections` WHERE (`sections`.`id` = 953125641)

  def edit
    @section = Section.find(params[:id])
---
SELECT * FROM `sections` WHERE (`sections`.`id` = 953125641)

  def create
    @section = Section.new(params[:section])

    respond_to do |format|
      if @section.save
---
INSERT INTO `sections` (`updated_at`, `title`, `page_id`, `position`, `created_at`) VALUES('2009-02-16 08:16:33', NULL, NULL, NULL, '2009-02-16 08:16:33')

  def update
    @section = Section.find(params[:id])
---
SELECT * FROM `sections` WHERE (`sections`.`id` = 953125641)

  def destroy
    @section = Section.find(params[:id])
    @section.destroy
---
SELECT * FROM `sections` WHERE (`sections`.`id` = 953125641)
DELETE FROM `sections` WHERE `id` = 953125641